software.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pre Installed packages</title>
<meta name="author" content="Kanishak Vaidya" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./style.css">
</head>
<body>
<div id="content" class="content">
<nav id="nav">
    <ul>
       <li class="">
           <a href="./index.html">Home</a>
       <li class="">
           <a href="./screenshots.html">Screenshots</a>
       <li class="">
           <a href="./installation.html">Install KVOS</a>
       <li class="">
           <a href="./guide.html">Guide</a>
       <li class="current">
           <a href="./software.html">Pre-Installed</a>
    </ul>
</nav>

<p>
The following packages will be installed with <b>KVOS installation script</b>.
These packages are mentioned in <a href="static/scripts/packages.md">packages.md</a> file. Heading of every category has a <code>- [ ]</code> in front of it. Change it to <code>- [X]</code> to install packages written below the <code>- [X]</code> line. Other packages will be ignored.
</p>
<div id="outline-container-orgfa0fb00" class="outline-2">
<h2 id="orgfa0fb00">Base (Mandatory)</h2>
<div class="outline-text-2" id="text-orgfa0fb00">
<p>
alacritty arandr autoconf automake base bison blueman conky dunst efibootmgr exa fakeroot feh firefox flameshot flex fzf gcc geany git gvfs gvfs-mtp htop i3-gaps i3blocks i3lock jack2 kvantum libtool lxappearance-gtk3 lxqt-archiver lxsession-gtk3 m4 make man-db materia-gtk-theme neovim networkmanager network-manager-applet nodejs ntfs-3g otf-font-awesome patch pavucontrol-qt pcmanfm-qt picom pkgconf pulseaudio pulseaudio-alsa pulseaudio-bluetooth qt5ct ranger ripgrep rofi rsync sed smplayer smplayer-skins smplayer-themes sshfs starship ttf-dejavu ttf-hack ttf-indic-otf ttf-nerd-fonts-symbols-2048-em-mono udiskie unzip vte3 which xcolor xdg-user-dirs yarn zathura zathura-pdf-mupdf zip zsh zsh-autosuggestions zsh-completions zsh-syntax-highlighting
</p>
</div>
</div>

<div id="outline-container-org82389dd" class="outline-2">
<h2 id="org82389dd">Utilities</h2>
<div class="outline-text-2" id="text-org82389dd">
<p>
imagemagick rclone vlc v4l2loopback-dkms v4l2loopback-utils w3m xournalpp youtube-dl xf86-input-wacom
</p>
</div>
</div>

<div id="outline-container-org03305e6" class="outline-2">
<h2 id="org03305e6">Xorg (Mandatory)</h2>
<div class="outline-text-2" id="text-org03305e6">
<p>
xorg-server xorg-xinit
</p>
</div>
</div>

<div id="outline-container-org7dd887e" class="outline-2">
<h2 id="org7dd887e">amd-drivers</h2>
<div class="outline-text-2" id="text-org7dd887e">
<p>
amd-ucode mesa xf86-video-amdgpu
</p>
</div>
</div>

<div id="outline-container-orgf8d4e4c" class="outline-2">
<h2 id="orgf8d4e4c">intel-drivers</h2>
<div class="outline-text-2" id="text-orgf8d4e4c">
<p>
intel-ucode mesa xf86-video-intel
</p>
</div>
</div>

<div id="outline-container-org9f51391" class="outline-2">
<h2 id="org9f51391">nvidia drivers</h2>
<div class="outline-text-2" id="text-org9f51391">
<p>
nvidia nvidia-prime nvidia-utils nvtop
</p>
</div>
</div>

<div id="outline-container-org18ea596" class="outline-2">
<h2 id="org18ea596">Office suit</h2>
<div class="outline-text-2" id="text-org18ea596">
<p>
libreoffice-fresh
</p>
</div>
</div>

<div id="outline-container-org7e5a50b" class="outline-2">
<h2 id="org7e5a50b">Development</h2>
<div class="outline-text-2" id="text-org7e5a50b">
<p>
emacs pyright python-pip
</p>
</div>
</div>

<div id="outline-container-orgc9b76f7" class="outline-2">
<h2 id="orgc9b76f7">TeX/LaTeX</h2>
<div class="outline-text-2" id="text-orgc9b76f7">
<p>
texlive-most
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kanishak Vaidya</p>
</div>
</body>
</html>